scripts/load_high_tps.yml
config:
  target: "https://high-tps-api-994656192388.us-central1.run.app"
  http:
    pool: 1000
    maxSockets: 1000

  ensure:
    # Fail test if response times or error rates exceed these thresholds
    - "http.response_time.p99": 500
    - "http.response_code.4xx": { max_error_rate: 0.01 }
    - "http.response_code.5xx": { max_error_rate: 0.01 }

  phases:
    # --- Phase 1: Ramp Up ---
    - name: "Ramp-up to 1000 TPS"
      duration: 120
      arrivalRate: 100
      rampTo: 1000

    # --- Phase 2: Steady State ---
    - name: "Steady State at 1000 TPS"
      duration: 180
      arrivalRate: 1000

    # --- Phase 3: Spike ---
    - name: "Spike to 1200 TPS and hold"
      duration: 120
      arrivalRate: 1000
      rampTo: 1400

    - name: "Steady State at 1400 TPS"
      duration: 120
      arrivalRate: 1400

scenarios:
  - name: "High TPS GET Load Test"
    flow:
      # Simple GET call
      - get:
          url: "/"
          expect:
            - statusCode: 200

      # Optional small pause between requests
      - think: 0.05