scripts/weighted_scenario.yml
config:
  target: "https://orders-994656192388.us-central1.run.app"  # base target
  plugins:
    metrics-by-endpoint:
      # Group metrics by request name rather than URL
      useOnlyRequestNames: true
    ensure:
      thresholds:
        # p99 of response time must be <250
        - 'http.response_time.p90': 1000
  defaults:
    headers:
      Content-Type: "application/json"
  phases:
    - duration: 300
      arrivalRate: 150
      name: "Warm-up"
    - duration: 600
      arrivalRate: 150
      name: "150TPS"
    # - duration: 300
    #   arrivalRate: 150
    #   target: 300
    #   name: "RampUp_to_300"
    # - duration: 600
    #   arrivalRate: 300
    #   name: "SS_300_TPS"
    # # - duration: 60
    #   arrivalRate: 300
    #   target: 450
    #   name: "RampUp_to_450"
    # - duration: 420
    #   arrivalRate: 450
    #   name: "450_TPS_2min"
  thresholds:
    http_req_failed: ['rate<0.05']

scenarios:
  - name: "post-orders"
    weight: 100
    flow:
      - post:
          url: "https://orders-994656192388.us-central1.run.app/orders"
          json:
            userId: "u-456"
            items:
              - productId: "p-1"
                quantity: 2
              - productId: "p-2"
                quantity: 1
          expect:
            statusCode: 200

  # - name: "post-payments"
  #   weight: 10
  #   flow:
  #     - post:
  #         url: "https://payments-994656192388.us-central1.run.app/payments"
  #         json:
  #           orderId: "o-123"
  #           amount: 245
  #           currency: "USD"
  #           paymentMethod: "card"
  #         expect:
  #           statusCode: 200

  # - name: "get-users"
  #   weight: 80
  #   flow:
  #     - get:
  #         url: "https://users-nafj7uberq-uc.a.run.app"
  #         expect:
  #           statusCode: 200

  # - name: "get-random-error"
  #   weight: 20
  #   flow:
  #     - get:
  #         url: "https://random-error-api-994656192388.us-central1.run.app"
  #         expect:
  #           statusCode: 200

  # - name: "get-recommendations"
  #   weight: 100
  #   flow:
  #     - get:
  #         url: "https://recommendations-nafj7uberq-uc.a.run.app"
  #         expect:
  #           statusCode: 200

  # - name: "get-analytics"
  #   weight: 50
  #   flow:
  #     - get:
  #         url: "https://analytics-nafj7uberq-uc.a.run.app"
  #         expect:
  #           statusCode: 200

  # - name: "get-reports"
  #   weight: 60
  #   flow:
  #     - get:
  #         url: "https://reports-nafj7uberq-uc.a.run.app"
  #         expect:
  #           statusCode: 200